<template>
  <div class="protocol-centent">
    <h2>设计成果委托推广及交易协议</h2>
    (https://saas.taihuoniao.com，以下简称“铟果”) 声明<br />
    <p>根据《中华人民共和国合同法》及相关法律法规，本着资源共享、友好合作的原则，就铟果于“2018中国制造之美设计零距离资源对接会暨顺德第二届创新设计成果交易会”线上活动（以下简称成果交易会）中为用户推广及出售设计创新成果事宜达成一致，兹签订以下合作协议。在您提交设计成果在铟果推广及交易前请务必仔细阅读以下条款。您同意此在线条款之效力如同亲自签字、盖章的书面条款一样，对您具有法律约束力。本上传条款自您上传成功之日起在您与本公司之间产生法律效力。 若您不接受以下条款，请您立即停止提交或主动下架已上传设计成果来终止交易会相关服务。</p>
    <h3>
      第一条设计成果发布授权许可
    </h3>
    <p>
      【缔约方】本协议由您与北京太火红鸟科技有限公司共同缔结，本协议双方合称协议方，北京太火红鸟科技有限公司在本协议中亦称为“铟果”。
    </p>
    <h4>
      ( 一 ) 协议内容及生效
    </h4>
    <p>【协议内容】本协议内容包括协议正文及所有铟果已经发布或后续发布并依法通知您的与“设计成果发布授权许可协议”相关的铟果平台规则及其相关的介绍、通知、说明、解读等文案。前述规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。</p>
    <p>【协议生效】您应当在设计成果发布之前认真阅读全部协议内容，如您对本协议有任何疑问，应向铟果客服咨询。但无论您事实上是否发布设计成果之前认真阅读了本协议内容，只要您在线勾选签署了本协议，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得铟果对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</p>
    <p>如果您不同意本协议的约定，您应立即结束设计成果发布。</p>
    <p>【协议修订】铟果可根据法律及业务发展需要不时地制订、修改本协议（以下简称“变更事项”），并以平台公示的方式进行公告，不再单独通知您。如您不同意相关变更，您有权于变更事项确定的生效日前联系铟果反馈意见。如反馈意见得以采纳，铟果将酌情调整变更事项。如您对已生效的变更事项仍不同意的，应当立即下架设计成果，变更事项对您不产生效力；您继续进行任何交易会活动，包括但不限于维持所发布的设计成果信息、继续发布设计成果信息，则表示您同意已生效的变更事项。</p>
    <h4>( 二 ) 设计成果发布规则</h4>
    <p>【设计成果发布规则】在保证您的设计成果专利的安全性前提下，为扩大您在铟果发布的设计成果的曝光量，增加设计成果的成交率，我们将在交易会活动期间以定期开放或者设定权限的方式在铟果展示出售，此行为都视为您授权并同意铟果可根据铟果自主的选择。</p>
    <p>【设计成果发布规定】您发布的设计成果应该符合国家有关法律法规的规定，不会侵犯任何第三方的合法权益，您并承诺对该内容拥有完整的权利，或已经得到相关权利人的合法授权，铟果使用您所发布的内容不会对第三方权益产生不良影响。如因您发布的设计成果侵犯了任何第三方的权利，如您所发布的内容违反上述规定，为避免损失和不良影响的扩大，铟果有权要求您立即修正，或直接采取删除、屏蔽相应内容等必要的措施。</p>
    <p>【设计成果发布责任】您充分了解并同意，无论该内容是否同步到了的铟果，您必须为自己发布的设计成果承担全部责任及后果。如导致任何第三方损害的，您应当独立承担责任；铟果因此遭受损失的，您也应当一并赔偿。</p>
    <h4>( 三 ) 协议终止</h4>
    <p>【终止的情形】出现以下情况时，本协议终止，本协议终止后，您将无法继续进行交易会活动：</p>
    <p>1、自然终止：如您在线签署的《许可协议》因任何原因终止，则本协议将同时终止。</p>
    <p>2、通知解除：铟果可提前十五（15）天以书面通知的方式终止本协议。</p>
    <p>3、铟果单方解除权：如您违反本协议中的约定或铟果平台的规则，铟果可立即终止本协议，且按有关规则对您进行惩罚。</p>
    <p>4、本协议（含规则）变更时，您明示并通知铟果不愿接受新的许可协议，则本协议自铟果收到您通知之日起自动终止。</p>
    <p>5、本协议规定的其他协议终止条件发生或实现，导致本协议终止。</p>
    <p>【终止的影响】无论本协议因何原因终止，在协议终止前的行为所导致的任何赔偿和责任，您必须完全且独立地承担责任。即使本协议终止，铟果及其关联公司仍可根据本协议的规定处理，本协议有效期内发生的交易所导致的买家索赔。</p>
    <h4>( 四 ) 争议解决</h4>
    <p>本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国大陆地区法律予以处理，并以北京太火红鸟科技有限公司所在地人民法院为管辖法院。</p>
    <h3>第二条权利与义务</h3>
    <h4>( 一 ) 用户权利和义务</h4>
    <p>【终止的情形】出现以下情况时，本协议终止，本协议终止后，您将无法继续进行交易会活动：</p>
    <p>1、在您提交设计成果时，您已经阅读、理解并接受本协议的全部条款及各类规则，并承诺遵守中国的各类法律规定，如有违反而导致任何法律后果的发生，您将以自己的名义独立承担所有相应的法律责任。</p>
    <p>2、用户须如实向铟果上传推广设计成果所需要的相关资料、知识产权情况及其他推广材料，积极配合成果交易会有关线上开展项目推广及出售活动。</p>
    <p>3、用户须是其提供的项目的原创者，鼓励用户对项目申请专利或取得其他有效的保护知识产权方式。</p>
    <p>4、用户有权利拥有自己在铟果的通行证，包括但不限于用户名、登录密码，并有权利使用自己的用户名及密码随时登录本设计创新服务平台。用户不得以任何形式擅自转让或授权他人使用自己在铟果的用户名。</p>
    <p>5、用户有权根据本服务协议的规定以及铟果上发布的相关规则、声明利用铟果查询设计成果信息、发布设计成果、查看设计需求、接单等与其他用户订立设计买卖合同、参加铟果的有关活动以及有权享受铟果提供的其他的相关信息服务。用户保证其具有相应的法律权利和行为能力进行上述活动，其在铟果进行或参与上述行为不会导致其违反任何适用的法律法规，及对用户具有约束力的合同、协议、法院及仲裁机构的有效裁判、规章、行政许可、政府命令、禁令及其他文件的规定，并保证对该等行为独立承担一切法律责任（包括但不限于出售非法或侵权设计成果的法律责任及任何对第三方的侵权及违约责任）。若本铟果因任何可归咎于用户违反法律法规，或对用户具有约束力的合同、协议、法院及仲裁机构的有效裁判、规章、行政许可、政府命令、禁令及其他文件的行为承担任何连带责任，用户同意对本铟果的损失予以全额赔偿。</p>
    <p>6、用户在本铟果进行网上交易过程中如与其他用户因交易产生纠纷，可以请求平台从中予以协调。用户如发现其他用户有违法或违反本服务协议的行为，可以向本铟果进行反映要求处理。如用户因网上交易与其他用户产生诉讼的，用户有权通过司法部门要求本铟果提供帮助。</p>
    <p>7、用户有义务提供自己的真实资料（包括但不限于有效身份证复印件），并保证诸如电子邮件地址、联系电话等内容的真实性、有效性及安全性，保证本铟果及其他用户可以通过上述联系方式与自己进行联系。同时，用户也有义务在相关资料实际变更时及时更新有关注册资料。用户保证不以他人资料在本铟果进行注册或认证。用户保证当绑定注册信息（包括但不限于电子邮件、银行帐户）丢失或失效时，及时与本铟果联系，并注销该帐户。</p>
    <p>8、用户应当保证在使用本铟果进行接单或者出售设计成果过程中遵守诚实信用的原则，不发布虚假信息，不恶意抬高物价，不在交易过程中采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。</p>
    <p>9、用户在本铟果设计创新成果交易会上不得发布各类违法或违规信息。</p>
    <p>10、用户承诺自己在使用本铟果时实施的所有行为遵守国家法律、法规和本铟果的相关规定以及各种社会公共利益或公共道德。对于任何法律后果的发生，用户将以自己的名义独立承担所有相应的法律责任。</p>
    <p>11、不作商业性利用。用户同意，不对本铟果及其任何资料作商业性利用，包括但不限于在未经本铟果事先书面同意的情况下，以复制、传播等方式使用在本铟果上展示的任何资料。</p>
    <p>12、用户同意接收来自本铟果的信息。</p>
    <h4>( 二 ) 本铟果权利和义务</h4>
    <p>1、本铟果有义务在现有技术上维护整个铟果产品创新平台的正常运行，并努力提升和改进技术，使用户网上接单及交易活动能够顺利进行。</p>
    <p>2、本铟果将用户提供的设计创新成果制作成统一的展示资料，于铟果D3INGO产品创新SaaS铟果进行线上展示推广及出售，本次成果交易会将向用户收取成交订单额10%服务费。</p>
    <p>3、本铟果向用户提供线上铟果推广及出售服务，由用户对项目展示资料在铟果上进行上传编辑，本铟果在后期统一整理成档及线上展示的过程中，仅对排版进行编辑，不得私自修改项目内容。</p>
    <p>4、本铟果负有保守商业秘密的义务，不得私自对外泄露本协议以及因履行本协议所知悉的商业秘密（包括但不限于设计项目方案、项目定价等内容）。除非：i. 依据本协议条款或者用户与本铟果之间其他服务协议、合同、在线条款等规定可以提供；ii. 依据法律法规的规定应当提供；iii. 行政、司法等有权部门要求本铟果提供；iv. 用户同意本铟果向第三方提供；v. 本铟果解决举报事件、提起诉讼而提交的；vi. 本铟果为防止严重违法行为或涉嫌犯罪行为发生而采取必要合理行动所必须提交的；vii. 本铟果为向用户提供产品、服务、信息而向第三方提供的，包括本铟果通过第三方的技术及服务向用户提供产品、服务、信息的情况。</p>
    <p>5、本铟果有权使用用户资料。</p>
    <p>6、对用户在使用本铟果线上交易会中所遇到的与交易相关的问题及反映的情况，本铟果将会及时做出回复。对用户在使用本铟果线上交易会中所遇到的与交易相关的问题及反映的情况，本铟果将会及时做出回复。</p>
    <p>7、对于在本铟果线上交易会的不当行为或其它任何本铟果认为应当终止服务的情况，本铟果有权随时做出删除相关信息、终止服务提供等处理，而无须征得用户的同意。如用户违反本协议及铟果相关规则、声明等内容，铟果有权采取包括但不限于限制订单、锁定用户名、封锁个别IP、终止服务直至永久锁定用户账户等一项或多项处理措施。</p>
    <p>8、鉴于设计成果交易的特殊性，本铟果有义务对用户的资料、所有的交易行为以及与交易有关的其他事项进行事先审查，如存在下列情况，本铟果有权根据不同情况选择保留或删除相关信息以及选择继续或停止对该用户提供服务，并追究相关法律责任：</p>
    <p class="indent">( 1 ) 用户或其他第三方通知本铟果，认为某个具体用户或具体交易事项可能存在重大问题；</p>
    <p class="indent">( 2 ) 用户或其他第三方向本铟果告知设计成果上有违法或不当行为的，本铟果以普通非专业交易者的知识水平标准对相关内容进行判别，可以明显认为这些内容或行为具有违法或不当性质的；</p>
    <p>9、用户因在本铟果从事交易与其他用户产生诉讼的，用户通过司法部门或行政部门依照法定程序要求本铟果提供相关资料，本铟果应积极配合并提供有关帮助。</p>
    <p>10、本铟果有权对用户的注册资料，接单及交易行为进行查阅，发现注册资料接单或交易行为中存在任何问题或怀疑，均有权向用户发出询问及要求改正的通知或者直接做出删除等处理。</p>
    <p>11、经国家生效法律文书或行政处罚决定确认用户存在违法行为，或者本铟果有足够事实依据可以认定用户存在违法或违反服务协议行为的，本铟果有权选择下列一种或多种处理措施进行处理：</p>
    <p class="indent">( 1 ) 中止或终止用户网上交易权限；</p>
    <p class="indent">( 2 ) 注销或删除用户帐户；</p>
    <p class="indent">( 3 ) 在本铟果以网络发布形式公布用户的违法行为。</p>
    <p>12、关于Cookies的限制，本铟果会在用户的电脑上设定或取用cookies。本铟果允许那些在本铟果网页上发布广告的平台到用户电脑上设定或取用cookies。在用户登录时获取资料，本铟果使用cookies可为您用户提供个性化服务。如果拒绝所有cookies，用户将不能使用需要登录的本铟果产品及服务内容。</p>
    <p>13、您将对使用该账户及密码进行的一切操作及言论负完全的责任，您同意：</p>
    <p class="indent">( 1 ) 本铟果通过您的用户名和密码识别您的指示，请您妥善保管您的用户名和密码，对于因密码泄露所致的损失，由您自行承担。</p>
    <p class="indent">( 2 ) 如您发现有他人冒用或盗用您的账户及密码或任何其他未经合法授权之情形时，应立即以有效方式通知本铟果，要求本铟果暂停相关服务。同时，您理解本铟果对您的请求采取行动需要合理期限，在此之前，本铟果对已执行的指令及(或)所导致的您的损失不承担任何责任。</p>
    <p class="indent">( 3 ) 您同意，基于运行和交易安全的需要，本铟果可以暂时停止提供或者限制本服务部分功能,或提供新的功能，在任何功能减少、增加或者变化时，只要您仍然使用本服务，表示您仍然同意本协议或者变更后的协议。</p>
    <p class="indent">( 4 ) 用户在交易过程中可能产生用户名被盗或被骗的情况，由此您同意，为维护您的权益，本铟果可以视情况采取重置用户密码及限制资金支付的操作。</p>
    <h3>第三条免责条款</h3>
    <p>鉴于本公司不参与本网站用户之间的实际交易，用户如与一名或多名其他用户发生争议，用户应就上述争议产生的或在任何方面与上述争议有关的每一种类和性质的已知或未知、可疑或非可疑、披露或未披露的索赔、要求和损害免除本公司（和本公司的高级职员、董事、代理人、关联公司、母公司、子公司和雇员）的责任，具体免责事项包括但不限于如下情形之规定：</p>
    <p>1、关于以下事由造成的各项损失，本公司免责：</p>
    <p class="indent">( 1 ) 战争、事变、天灾地变等，不可抗力等情况；</p>
    <p class="indent">( 2 ) 用户之间文件交接过程所造成的损坏、遗失；</p>
    <p class="indent">( 3 ) 因通信服务提供业者方面造成之通信障碍；</p>
    <p class="indent">( 4 ) 用户身份之真实性、民事权利能力民事行为能力之适当性、用户信用程度之可靠性；</p>
    <p class="indent">( 5 ) 设计成果来源合法性、权利归属、真伪性、数量质量性能等各种事项之真实准确完整性；</p>
    <p class="indent">( 6 ) 其他非本网站所能控制或掌握之事项。</p>
    <p>2、本公司所有连结网站皆为独立营运网站，与各用户之间的互动与交易行为本公司免责。</p>
    <p>3、本网站免责声明规定之事项，本公司免责。</p>
  </div>
</template>
<script>
  export default {
    name: 'sdDesign_protocol',
    mounted() {
      let oldClass = document.getElementById('app').getAttribute('class')
      if (oldClass) {
        oldClass = oldClass.replace(/app2\x20?/g, '')
      }
      document.body.removeAttribute('class', 'app2')
      document.getElementById('app').setAttribute('class', oldClass)
      document.childNodes[1].removeAttribute('class', 'app2')
    },
    beforeDestroy () {
      let oldClass = document.getElementById('app').getAttribute('class')
      if (oldClass) {
        oldClass = oldClass.replace(/app2\x20?/g, '')
      }
      document.body.setAttribute('class', 'app2')
      document.getElementById('app').setAttribute('class', 'app2 ' + oldClass)
      document.childNodes[1].setAttribute('class', 'app2')
    }
  }
</script>
<style scoped>
  .protocol-centent {
    padding: 30px;
  }
  .protocol-centent p{
    line-height: 30px;
    color: #666;
  }
  h2 {
    color: #222;
    font-size: 20px;
    line-height: 30px;
    text-align: center;
    margin-bottom: 20px;
  }
  h3 {
    color: #222;
    font-size: 18px;
    line-height: 25px;
    margin: 20px 0 10px 0;
  }
  h4 {
    color: #222;
    font-size: 16px;
    line-height: 22px;
    margin: 20px 0 10px 0;
  }
  .indent {
    text-indent: 2em;
  }
</style>
